package com.ixiaoyu2.leetcode.two_week;

/**
 * @author :Administrator
 * @date :2022/5/1 0001
 */
public class Code04_D {

    /*  给你一个下标从 0开始大小为 m x n的二维整数数组grid，它表示一个网格图。每个格子为下面 3 个值之一：
      0 表示草地。
      1 表示着火的格子。
      2表示一座墙，你跟火都不能通过这个格子。
      一开始你在最左上角的格子(0, 0)，你想要到达最右下角的安全屋格子(m - 1, n - 1)。每一分钟，你可以移动到相邻的草地格子。每次你移动 之后，着火的格子会扩散到所有不是墙的相邻格子。

      请你返回你在初始位置可以停留的 最多 分钟数，且停留完这段时间后你还能安全到达安全屋。

      如果无法实现，请你返回 -1。

      如果不管你在初始位置停留多久，你 总是能到达安全屋，请你返回10^9。

      注意，如果你到达安全屋后，火马上到了安全屋，这视为你能够安全到达安全屋。

      如果两个格子有共同边，那么它们为 相邻格子。

      来源：力扣（LeetCode）
      链接：https://leetcode-cn.com/problems/escape-the-spreading-fire
      著作权归领扣网络所有。商业转载请联系官方授权，非商业转载请注明出处。*/


    public int maximumMinutes(int[][] grid) {

        return 0;
    }
}
